[
  {
    "name": "Code Golf",
    "category": "Coding Challenge",
    "description": "Think you can solve problems in the fewest characters? URECKON'25 presents CODE GOLF! Sharpen your skills, trim your code, and prove less is more.",
    "date": "1st March 2025",
    "rules": {
      "equal_points": "All problems carry the same base points.",
      "bonus_for_short_code": "Higher points are awarded for shorter solutions.",
      "ranking_criteria": "Participants are ranked based on the shortest code and the number of problems solved.",
      "timing_rules": "Total time is calculated as the sum of time spent on each solved problem. No penalties apply.",
      "bonus_language_marks": "There will be 4 questions. For each question, the coordinators will specify a bonus language. Participants who solve the problem using this language will earn extra marks. Solutions in other languages are allowed but will only receive standard points.",
      "final_authority": "The decision of the organizers in declaring the results will be final. No queries in this regard will be entertained.",
      "tiebreaker": "In case of a tie, the participant with the least time ranks higher. In case of further ties, the time of the last accepted submission, for the highest numbered solved problem may be considered.",
      "zero_tolerance_for_malpractice": "Any participant caught in malpractice will be disqualified. All submissions must come from a single account."
    },
    "event_coordinators": [
      { "name": "Debanjan Mukherjee", "contact": "7865891741" },
      { "name": "Diprajit Chakraborty", "contact": "9875383377" }
    ]
  },
  {
    "name": "Code Ranch",
    "category": "Coding Challenge",
    "description": "Race against the clock to solve challenges with speed and precision. Register now and show the world what you've got!",
    "date": "1st March 2025",
    "time": "7:00 PM to 9:00 PM IST",
    "rules": {
      "team_size": "1 to 2 members per team",
      "duration": "2 hours",
      "platform": "Hackerrank",
      "no_of_questions": 5,
      "contest_type": "Closed",
      "ranking_mechanism": "ICPC",
      "most_solved_problems": "One who solves the maximum number of problems correctly wins.",
      "penalty_time": "For each incorrect submission, a penalty time is added to the team's total time for the problem.",
      "tiebreaker_1": "In case of a tie, the participant with least time ranks higher.",
      "tiebreaker_2": "In case of further ties, the time of the last accepted submission, for the highest numbered solved problems may be considered.",
      "event_codes_of_conduct": [
        "Each team must submit the problems with a single Hackerrank account. Only one submission per team will be considered.",
        "Any illegal activities not in accordance with the competition, if reported, will result in disqualification.",
        "The coordinators' decisions will be final for all aspects of the competition.",
        "All code must be original and not copied from elsewhere.",
        "Plagiarism will result in disqualification."
      ]
    },
    "event_coordinators": [
      { "name": "Prithvi Sen", "contact": "9734466555" },
      { "name": "Santadip Rudra", "contact": "7044522841" }
    ]
  }
]
