[
  {
    "name": "URECKON INNOVATION CHALLENGE",
    "category": "Innovation Challenge",
    "description": "A platform for participants to demonstrate their hardware or software models to judges. Special credits are given to models in AI, IoT, Automation, Disaster Management, Energy Conservation, Healthcare & Cleanliness.",
    "venue": "To be announced",
    "date": "1st and 2nd March 2025",
    "rules": {
      "team_size": "Maximum 5 members (at least one member must be present with the model at all times)",
      "eligibility": "Team members may be from the same or different colleges",
      "event_rules": [
        "Each team must bring their own equipment; no electronic components will be provided.",
        "Each team must bring a description chart (model name, model description, utility, etc.).",
        "Judges will evaluate models based on originality, feasibility, impact, and scalability."
      ]
    },
    "event_coordinators": [
      { "name": "Pratyay Chatterjee", "contact": "89183 89523" },
      { "name": "Rajdeep Banerjee", "contact": "86174 79106" },
      { "name": "Priyanshu Ghosh", "contact": "8420688671" },
      { "name": "Sandipan Dubey", "contact": "6289 980 461" }
    ]
  },
  {
    "name": "URECKON INTERNATIONAL CODING CHALLENGE",
    "category": "Competitive Coding",
    "description": "The ultimate battleground for competitive programmers at Ureckon 2025. Participants solve complex problems with speed and precision to claim victory.",
    "venue": "Online",
    "date": "1st and 2nd March 2025",
    "rules": {
      "team_size": "Solo participation only",
      "event_rules": [
        "Duration: 3 hours.",
        "Contest will be hosted on the Hackerrank platform.",
        "Use of electronic gadgets and the internet for unfair means is strictly prohibited.",
        "Plagiarism will result in immediate disqualification.",
        "Coordinators' decisions are final in all aspects of the competition."
      ]
    },
    "event_coordinators": []
  },
  {
    "name": "TECH-EXPO",
    "category": "Technology Showcase",
    "description": "An event designed for school students to display models, posters, and presentations related to emerging technology. Industry professionals and participants can network and share knowledge.",
    "venue": "To be announced",
    "date": "2nd March 2025",
    "rules": {
      "team_size": "Maximum 5 members; solo participation allowed",
      "eligibility": "Participants must be school students (class 8 to 12)",
      "event_rules": [
        "Projects must be based on cutting-edge technology.",
        "Participants must bring all necessary equipment (poster, laptops, extension cables, batteries, etc.).",
        "PowerPoint presentations are allowed, but teams must bring their own devices to display them."
      ]
    },
    "event_coordinators": [
      { "name": "Pratyay Chatterjee", "contact": "89183 89523" },
      { "name": "Rajdeep Banerjee", "contact": "86174 79106" },
      { "name": "Priyanshu Ghosh", "contact": "8420688671" },
      { "name": "Sandipan Dubey", "contact": "6289 980 461" }
    ]
  }
]
